Задание 1: Запуск нескольких потоков (Thread)
Цель: научиться создавать и запускать потоки вручную.
Описание:
Напишите программу, которая создает три потока. Каждый поток должен:
1.	Выводить в консоль своё имя и номер итерации (например, "Поток 1 - итерация 3").
2.	Работать в цикле 5 итераций с паузой в 500 мс между итерациями.
3.	Запускаться параллельно с другими потоками.
4.	Попробуйте присоединить (Join) потоки к основному потоку и замерьте время выполнения.

Задание 2: Гонки потоков (Thread Safety)
Цель: разобраться с проблемой гонок потоков и синхронизацией данных.
Описание:
Создайте общий счётчик (int counter = 0), который увеличивается в двух потоках.
1.	Каждый поток должен увеличивать счётчик 1000 раз.
2.	Вывести результат в конце выполнения всех потоков.
3.	Запустить программу несколько раз и обратить внимание на неожиданные результаты.
4.	 Исправьте проблему с помощью lock или Interlocked.

Задание 3: Использование Task
Цель: понять, как работает Task и его преимущества перед Thread.
Описание:
Напишите программу, которая выполняет три асинхронные задачи (Task.Run).
1.	Каждая задача должна выводить в консоль своё имя и выполняться от 1 до 3 секунд (используйте Task.Delay).
2.	Дождитесь выполнения всех задач (Task.WhenAll).
3.	Замерьте общее время выполнения и сравните с последовательным запуском.
4.	Сделайте так, чтобы одна задача выбрасывала исключение, и обработайте его.

Задание 4: Параллельное вычисление факториала (Parallel.For)
Цель: изучить параллельный цикл Parallel.For и его преимущества.
Описание:
Напишите программу, которая вычисляет факториалы чисел от 1 до 10 в параллельном цикле Parallel.For.
1.	Используйте Parallel.For(1, 11, i => { ... }).
2.	Выводите результат в консоль (Console.WriteLine).
3.	Оцените разницу в скорости по сравнению с обычным for.
4.	Сохраните результаты в ConcurrentDictionary<int, long>.

Задание 5: Асинхронная загрузка данных (async/await)
Цель: научиться использовать async и await.
Описание:
Напишите программу, которая загружает 3 веб-страницы (например, https://google.com).
1.	Используйте HttpClient и await client.GetStringAsync(url).
2.	Каждая загрузка должна выполняться параллельно.
3.	После загрузки вывести длину содержимого каждой страницы.
4.	Обработайте возможные ошибки (try/catch).

Используемые библиотеки:
using System; using System.Threading.Tasks; using System.Threading; using System.Diagnostics; using System.Collections.Generic;

Сложности:
Использование Task и понятие async/await

Крюков Андрей
